{
  "_meta": {
    "maxChars": {
      "newGame": 20,
      "continue": 20,
      "ipadButton": 20,
      "chromebookButton": 20,
      "labText1": 60,
      "labText2": 170,
      "labText3": 140,
      "labText4": 140,
      "labText5": 60,
      "labText6": 280,
      "labText7": 210,
      "labText8": 148,
      "labText9": 150,
      "labText10": 700,
      "labText11": 170,
      "labText12": 700,
      "labText13": 60,
      "labText14": 60,
      "book1BP1": 120,
      "book1BP2": 90,
      "book1BP3": 100,
      "Book1BP4": 120,
      "book1BP5": 110,
      "book1BP6": 110,
      "book2BP1": 170,
      "book2BP2": 200,
      "book2BP3": 130,
      "book2BP4": 180,
      "book3BP1": 170,
      "book3BP2": 140,
      "book3BP3": 190,
      "book3BP4": 130,
      "book4BP1": 160,
      "book4BP2": 160,
      "book4BP3": 150,
      "book4BP4": 160,
      "book5BP1": 180,
      "book5BP2": 120,
      "book5BP3": 170,
      "book5BP4": 180,
      "book5BP5": 140,
      "book5BP6": 110,
      "referenceButton": 20,
      "citationInfoBook1": 100,
      "stage1Text1": 100,
      "stage1Text2": 150,
      "stage1Text3": 80,
      "stage1Text4": 100,
      "stage1Text5": 140,
      "signText1": 20,
      "signText2": 20,
      "signText3": 20,
      "thomasJefferson1Pretext": 150,
      "thomasJefferson1Letter1": 200,
      "thomasJefferson2Letter2": 200,
      "thomasJefferson3Letter3": 320,
      "thomasJefferson4Letter4": 110, 
      "thomasJeffersonWesternPrior1": 220,
      "thomasJeffersonWesternPrior2": 180,   
      "thomasJeffersonWesternPrior3": 210,
      "stage1Scene2MiniGame2Text": 130,
      "stage1Scene2MiniGame2Question": 80,
      "stage1Scene2MiniGame2InCorrect": 80,
      "stage1Scene2MiniGame2Correct1": 120,
      "stage1Scene2MiniGame2Correct2": 130,
      "stage1Scene2MiniGame2Correct3": 110,
      "stage1Scene2MiniGame2Answer1": 60,
      "stage1Scene2MiniGame2Answer2": 60,
      "stage1Scene2MiniGame2Answer3": 60,
      "stage1Scene2MiniGame2Answer4": 60,
      "stage1Scene2MiniGame2Complete": 90, 
      "stage1Scene2MoveToParis": 150,
      "stage1Scene3Start": 100,
      "napoleonLetter1": 220,
      "napoleonLetter2": 240,
      "napoleonLetter3": 260,
      "napoleonLetter4": 200,
      "napoleonLetter5": 270,
      "stage1Scene3Talks": 140,
      "taskStage1Scene3": 130,
      "napoleonName": 20,
      "jamesMonroeName": 20,
      "choiceA": 20,
      "choiceB": 20,
      "napoleonChoice1a": 100,
      "napoleonChoice1b": 100,
      "monroeChoice1a": 60,
      "monroeChoice1b": 60,
      "napoleonChoice2a": 60,
      "napoleonChoice2b": 60,
      "monroeChoice2a": 60,
      "monroeChoice2b": 60,
      "monroeChoiceBuyLouisiana": 170,
      "monroeChoiceBuyOrleans": 150,
      "textToMoveToScene1Stage4": 80,
      "startScene1Stage4": 80,
      "stage1Scene4Text1": 75,
      "stage1Scene4Text2": 60,   
      "stage1Scene4Text3": 70,   
      "stage1Scene4Text4": 150,   
      "stage1Scene4Text5": 70,   
      "stage1Scene4Text6": 110,   
      "stage1Scene4Text7": 50,
      "politicalEcoCultureLetter1": 310,
      "politicalEcoCultureLetter2": 250, 
      "politicalEcoCultureLetter3": 270,
      "mapKeyAmerica": 40,
      "mapKeyLouisiana": 40,
      "mapKeySpanish": 60,
      "mapKeyFlorida": 40,
      "mapStartIllinois": 40,
      "mapPoint1Mississippi": 40,
      "mapPoint2RockyMountain": 40,
      "mapPoint3PacificCoast": 40,
      "maptext1": 50,
      "maptext2": 200,
      "maptext3": 110,
      "maptext4": 90,
      "mapDecisionText1": 40,
      "mapDecisionAnswer1North": 10,
      "mapDecisionAnswer2South": 10,
      "mapDecisionAnswer3East": 10,
      "mapDecisionAnswer4West": 10,
      "mapDecisionAnswerWrong": 100,
      "mapDecisionAnswerCorrect": 115,
      "mapDecision2Text1": 150,
      "mapDecision2Answer1": 40,
      "mapDecision2Answer2": 160,
      "mapDecision2Answer3": 40,
      "mapDecision2AnswerWrong": 140,
      "mapDecision2AnswerCorrect": 250,
      "mapDecision3Text1": 100,
      "mapDecision3Answer1": 60,
      "mapDecision3Answer2": 40,
      "mapDecision3Answer3": 50,
      "mapDecision3AnswerWrong1": 80,
      "mapDecision3AnswerWrong2": 100,
      "mapDecision3AnswerCorrect": 160,
      "mapComplete": 180,
      "mapComplete2": 80,
      "stage2Scene1Text1": 100,
      "stage2Scene1Text2": 60,
      "stage2Scene1Text3": 80,
      "stage2Scene1Text4": 80,
      "stage2Scene1Text5": 110,
      "stage2Scene1Text6": 80,
      "stage2Scene1Text7": 60,
      "stage2Scene1Text7Choice1": 60,
      "stage2Scene1Text7Choice2": 90,
      "stage2Scene1Text8": 170,
      "stage2Scene1Text9": 120,
      "oregonLetter1": 330,
      "oregonLetter2": 310,
      "oregonLetter3": 290,
      "oregonLetter4": 300,
      "stage2Scene2Text1": 110,
      "stage2Scene2Text2": 200,
      "stage2Scene2Text2Choice1": 110,
      "stage2Scene2Text2Choice2": 70,
      "stage2Scene2Text3": 210,
      "stage2Scene2Text4": 200,
      "stage2Scene2Text5": 50
      "stage2Scene3Text1": 50,
      "stage2Scene3Text2": 190,
      "stage2Scene3Text2Choice1": 50,
      "stage2Scene3Text2Choice2": 110,
      "stage2Scene3Text3": 250,
      "stage2Scene3Text4": 210,
      "stage2Scene3Text5": 70,
      "stage2Scene3Text6": 185,
      "stage3Scene1Text1": 110,
      "stage3Scene1Text2": 200,
      "texasLetter1header": 330,
      "texasLetter1": 330,
      "texasLetter2header": 310,
      "texasLetter2": 310,
      "texasLetter3header": 290,
      "texasLetter3": 300,
      "stage3Scene1Text3": 200,
      "stage3Scene1Text4Task": 200,
      "stage3Scene1Rule1": 200,
      "stage3Scene1Rule2": 200,
      "stage3Scene1Rule3": 200,
      "stage3Scene1Rule4": 200,
      "stage3Scene1Rule5": 200,
      "stage3Scene1IsThisCorrect": 80,
      "stage3Scene1Rule1Answer": 200,
      "stage3Scene1Rule2Answer": 200,
      "stage3Scene1Rule3Answer": 200,
      "stage3Scene1Rule4Answer": 200,
      "stage3Scene1Rule5Answer": 200,
      "stage3Scene1TextEnd": 200,
      "stage3Scene2Text1": 90,
      "stage3Scene2Text2": 30,
      "stage3Scene2Text3": 100,
      "mexicoLetter1header": 50,
      "mexicoLetter1a": 270,
      "mexicoLetter1b": 230,
      "mexicoLetter2header": 50,
      "mexicoLetter2a": 220,
      "mexicoLetter2b": 160,
      "mexicoLetter3header": 50,
      "mexicoLetter3a": 250,
      "mexicoLetter3b": 210,
      "mexicoLetter4header": 50,
      "mexicoLetter4a": 320,
      "mexicoLetter3header": 50,
      "mexicoLetter5a": 310,
      "mexicoLetter5b": 190,
      "stage3Scene2Text4": 170,
      "stage3Scene2UsConcern1Laws": 130,
      "stage3Scene2UsConcern2Docs": 80,
      "stage3Scene2UsConcern3Outlawed": 80,
      "stage3Scene2UsConcern4Hunt": 70
      "stage3Scene2ReturnToPolk": 50,
      "stage3Scene2Text4Select": 80,
      "stage3Scene2Text5Wrong": 120,
      "stage3Scene2Text6Correct": 90,
      "stage3Scene2Text7": 110,
      "stage3Scene2Text8": 240,
      "stage3Scene2Text9End": 60,

    }
  },
  "en": {
    "newGame": "New Game!",
    "continue": "Continue?",
    "ipadButton": "iPad",
    "chromebookButton": "Chromebook",
    "labText1": "Incoming transmission… Robot 419, do you read us?",
    "labText2": "Your mission today: travel back to America in the early 1800s and learn all you can about Manifest Destiny and witness firsthand America’s westward expansion.",
    "labText3": "Start by collecting the letter and the time travel device on the table in front of you. Tap the screen or click to move closer.",
    "labText4": "This letter was sent back by our Correspondence Bot, currently stationed in the 1800s. Let’s open it and see what it says.",
    "labText5": "Greetings, Robot 419!",
    "labText6": "Manifest Destiny was the 19th-century belief that it was the United States 'Obvious Fate' to expand across all of North America. Coined by journalist John O’Sullivan in 1845, it claimed Americans had a divine duty to spread democracy and liberty.",
    "labText7": "This idea was used to ignore land claims by Great Britain, Mexico, and Indigenous peoples. Supporters believed expansion was part of God’s plan, even if it meant using force or unfair tactics.",
    "labText8": "By 1848, the U.S. had tripled in size, gaining land through treaties, settlements, deception, and war, all in the name of spreading American values.",
    "labText9": "I've placed this information in a book in your inventory. There is a button at the top right of he screen to open it. Let's do that now.",
    "labText10": "You can see there is a book in your inventory. Let's open it.",
    "labText11": "This book contains all the information we learned in the correspondence bot's letter. You can close it with the small X button in the top right of the book.",
    "labText12": "Okay. Let's head back to 1803 with our time travel device. Please push the big red button when ready.",
    "labText13": "",
    "labText14": "",
    "book1BP1": "In the 1800s, many Americans believed it was their country’s 'obvious fate' to grow across the whole continent.",
    "book1BP2": "A man named John O’Sullivan came up with the phrase 'Manifest Destiny' in 1845.",
    "book1BP3": "People thought it was their duty from God to spread freedom and democracy to new lands.",
    "book1BP4": "This belief was used to ignore the rights of Great Britain, Mexico, and Indigenous peoples who already lived on the land.",
    "book1BP5": "Some Americans believed that expansion was right, even if it meant using force or unfair methods.",
    "book1BP6": "By 1848, the United States had tripled in size through treaties, settlements, trickery, and war.",
    "book2BP1": "America is destined to expand westward and claim new land. Our young nation didn’t begin to grow through war — we grew with smart deals and brave settlers.",
    "book2BP2": "A man named James Monroe was sent to buy New Orleans for our farmers. Napoleon and France surprised us — they sold the US all of Louisiana instead! This peaceful deal doubled the country size.",
    "book2BP3": "In Texas, Americans moved in with Mexico’s permission. They promised to follow the rules — no fighting, just settlement.",
    "book2BP4": "Out west, Lewis and Clark explored new lands. Later, a path known as the South Pass made it easier for wagons to reach Oregon. As more settlers arrived, so did our claim.",
    "book3BP1": "In the early 1800s, farmers needed the Mississippi River and the port of New Orleans to sell their crops. If they lost access, they couldn’t make money.",
    "book3BP2": "The land west of the river—Louisiana—was owned by France. Farmers worried Napoleon might close New Orleans and stop their trade.",
    "book3BP3": "After losing a colony in Haiti, Napoleon changed his mind and the British were approaching. Instead of just New Orleans, he considered selling the whole Louisiana Territory. ",
    "book3BP4": "President Jefferson sent James Monroe to buy New Orleans for $10 million. But Napoleon offered the whole Louisiana Territory for $15 million!",
    "book4BP1": "Political Motivation: Many Americans believed in Manifest Destiny—the idea that the U.S. had a right to expand west and spread democracy and freedom.",
    "book4BP2": "Willing to Confront Rivals: The U.S. was prepared to challenge powerful nations like Great Britain and Mexico to fulfill its expansion goals.",
    "book4BP3": "Economic Opportunity: Western lands like Louisiana and Oregon promised valuable resources, trade routes, and fertile farmland for settlers.",
    "book4BP4": "Cultural Beliefs: Americans believed it was their God-given duty to spread their way of life, seeing themselves as culturally and morally superior.",
    "book5BP1": "Oregon was originally claimed by four nations—Russia, Spain, Britain, and the U.S.—but Indigenous groups like the Chinook and Nez Perce lived there long before those claims.",
    "book5BP2": "Spain and Russia gave up their claims, leaving Britain and the U.S. to jointly occupy the territory for a time.",
    "book5BP3": "Oregon Fever swept the nation as settlers were drawn by reports of rich farmland and forests, leading to thousands traveling the 2,000-mile Oregon Trail.",
    "book5BP4": "The Lewis and Clark expedition inspired Americans to head west, but it wasn’t until Jedediah Smith discovered South Pass in 1824 that wagons could make the journey safely.",
    "book5BP5": "President Polk demanded all of Oregon, but compromised with Britain by splitting the land at the 49th parallel to avoid war. ",
    "book5BP6": "As settlers moved in, Indigenous people were displaced by broken treaties and forced off their ancestral lands.",
    "referenceButton": "Reference",
    "citationInfoBook1": "Manifest Destiny and the Growing Nation - Introduction - Page 1",
    "stage1Text1": "Wow, we're really in 1803. There's a piece of paper on the ground here. Let's read it!",
    "stage1Text2": "We need to find Thomas Jefferson. Could you please search the camp for a wooden sign with the meaning of “Manifest Destiny” written on it?",
    "stage1Text3": "Does this sign have the meaning of the term 'Manifest Destiny' written on it?",
    "stage1Text4": "It sounds correct, but it isn’t. Have a look at the book in your inventory and try again.",
    "stage1Text5": "That's correct. Manifest Destiny means 'Obvious Fate'. Oh look, Thomas Jefferson is here and approaching us. Let's talk to him.",
    "signText1": "Obvious Fate",
    "signText2": "Certain Fate",
    "signText3": "Misplaced Fate",
    "thomasJefferson1Pretext": "My name is Thomas Jefferson. I have written you a letter. Will you please read it? Then I have a task I need you to complete for me.",
    "thomasJefferson1Letter1": "America is destined to expand westward and claim new land. Our young nation didn’t begin to grow through war — we grew with smart deals and brave settlers.",
    "thomasJefferson2Letter2": "I sent a man named James Monroe to buy New Orleans for our farmers. Napoleon and France surprised us — they sold us all of Louisiana instead! One peaceful deal doubled our country.",
    "thomasJefferson3Letter3": "In Texas, Americans moved in with Mexico’s permission. They promised to follow the rules — no fighting, just settlement.  Out west, Lewis and Clark explored new lands. Later, a path known as the South Pass made it easier for wagons to reach Oregon. As more settlers arrived, so did our claim.",
    "thomasJefferson4Letter4": "We used exploration, trade, and peaceful agreements — not armies — to begin to shape America’s future.",
    "thomasJeffersonWesternPrior1": "One of my great hopes for westward expansion is to open trade routes stretching from the Mississippi River all the way to the Pacific Ocean. Such paths would link our farms and cities to new ports and markets.",
    "thomasJeffersonWesternPrior2": "Along the way, we must greet the native nations with respect. Through fair trade and cultural exchange, I believe we can build trust and friendship as we journey west.",   
    "thomasJeffersonWesternPrior3": "I have written down these priorities for westward expansion, but I have left them around camp. Can you please search through the tents and crates to see if you can find them? There should be 3 to find.",
    "stage1Scene2MiniGame2Text": "Find 3 of Thomas Jefferson's priorities for Westward Expansion. Look through the crates in camp.",
    "stage1Scene2MiniGame2Question": "Is this one of Thomas Jefferson's priorities for Westward Expansion?",
    "stage1Scene2MiniGame2InCorrect": "Are you sure? Have a look at the books in your inventory and try again!",
    "stage1Scene2MiniGame2Correct1": "Correct, Thomas Jefferson prioritized creating trade routes along the Mississippi to reach the Pacific Ocean.",
    "stage1Scene2MiniGame2Correct2": "Correct, Thomas Jefferson saw greeting the natives and gaining good relations as a priority for westward expansion.",
    "stage1Scene2MiniGame2Correct3": "Correct, offering trade and a cultural exchange with the natives as a priority for westward expansion.",
    "stage1Scene2MiniGame2Answer1": "Offer native tribes trade and a cultural exchange.",
    "stage1Scene2MiniGame2Answer2": "Create trade routes along the Mississippi.",
    "stage1Scene2MiniGame2Answer3": "Greet native tribes and gain good relations.",
    "stage1Scene2MiniGame2Answer4": "Collect types of rocks to study back home.",
    "stage1Scene2MiniGame2Complete": "That's all 3 priorities collected. Let us head back to talk to Thomas Jefferson.",
    "stage1Scene2MoveToParis": "I have sent James Monroe to Paris to talk to Napoleon. Could you please head there now and see how the negotiations are progressing?",
    "stage1Scene3Start": "We’ve been transported to Napoleon's study in Paris. There's a letter here. Let’s read it!",    
    "napoleonLetter1": "In the early 1800s, American farmers were moving west. They used the Mississippi River to send crops to market through the port of New Orleans. It was super important — without it, they couldn’t sell their food.",
    "napoleonLetter2": "The land west of the river was called Louisiana. It belonged to France, led by Napoleon. He wanted to use the land to help feed his Caribbean colonies. But farmers were worried — if Napoleon closed New Orleans, they were stuck.",
    "napoleonLetter3": "Then, something big happened. In Haiti, formerly enslaved people led by Toussaint L’Ouverture defeated the French. Napoleon no longer needed Louisiana, and with a war against Britain coming, he decided to sell the land instead of risking losing it.",
    "napoleonLetter4": "President Jefferson sent James Monroe to buy New Orleans for $10 million. But Napoleon offered the whole Louisiana Territory for $15 million! That’s double the land for a great price.",
    "napoleonLetter5": "Some Americans didn’t like it — they thought it was too much land or that it broke the rules of the Constitution. But most people were excited. In 1804, Lewis and Clark set off to explore the new land, with help from a Shoshone woman named Sacagawea.",              
    "stage1Scene3Talks": "Napoleon and Monroe are starting negotiations. Let's take part in the talks and see if we can help them come to an agreement.",
    "taskStage1Scene3": "Take control of Napoleon and Monroe and choose what each one should say in the discussion of the Louisiana Purchase.",
    "napoleonName": "Napoleon",
    "jamesMonroeName": "James Monroe",
    "choiceA": "Choice A",
    "choiceB": "Choice B",
    "napoleonChoice1a": "War with Britain is coming, we must act swiftly, before the British seize our lands.",
    "napoleonChoice1b": "I think keeping hold of Lousianna is the best idea, in case we win the war with Britain",
    "monroeChoice1a": "We are prepared to purchase New Orleans.",
    "monroeChoice1b": "What are your intentions with Louisiana?",
    "napoleonChoice2a": "I will sell all of Louisiana for $15 million.",
    "napoleonChoice2b": "I can part with New Orleans for $10 million.",
    "monroeChoice2a": "Accept the full Louisiana deal.",
    "monroeChoice2b": " Insist on New Orleans only.",
    "monroeChoiceBuyLouisiana": "Success! For just $15 million, Monroe buys the entire Louisiana Territory, doubling the size of the U.S. and securing control of the Mississippi River!",
    "monroeChoiceBuyOrleans": "Monroe gets the port of New Orleans, but the vast Louisiana Territory stays in French hands. The U.S. misses a huge chance to expand west. Try again.",
    "textToMoveToScene1Stage4": "Let's head back to the US and tell Thomas Jefferson the great news!",
    "startScene1Stage4": "Let's talk to Thomas Jefferson.",
    "stage1Scene4Text1": "Welcome Back. I’ve just been told the great news about Louisiana.",
    "stage1Scene4Text2": "Now we should start looking at exploring it.",   
    "stage1Scene4Text3": "But before we do, this letter arrived for you. Take a look!",   
    "stage1Scene4Text4": "Meet Lewis and Clark. These brave explorers are going to map out and chart a route from Illinois all the way west to the pacific ocean.",   
    "stage1Scene4Text5": "But we need your help. On the table there is a map of the US.",   
    "stage1Scene4Text6": "We need you to look at it and help us make decisions on what Lewis and Clark should do along the way.",   
    "stage1Scene4Text7": "When you're ready. Approach the map.",
    "politicalEcoCultureLetter1": "Politically, the U.S. believed it was its Manifest Destiny to expand westward. Many Americans thought they had a right to spread U.S. political ideals—like democracy and freedom—to new lands. They were also willing to challenge other nations, such as Great Britain and Mexico, to achieve this goal.",
    "politicalEcoCultureLetter2": "Economically, gaining control of areas like Louisiana, the Oregon Territory, and western lands offered valuable resources, new trade routes, and fertile farmland. These were key economic reasons that motivated many settlers to move west.", 
    "politicalEcoCultureLetter3": "Culturally, a major reason for expansion was the belief in American superiority and divine right. Many people felt it was “God’s plan” for Americans to spread west, and they believed it was their moral duty to bring their way of life to new territories.",
    "mapKeyAmerica": "America",
    "mapKeyLouisiana": "Louisiana",
    "mapKeySpanish": "Spanish Territory",
    "mapKeyFlorida": "Florida",
    "mapStartIllinois": "Illinois",
    "mapPoint1Mississippi": "Mississippi river",
    "mapPoint2RockyMountain": "Rocky Mountains",
    "mapPoint3PacificCoast": "Pacific Oceon",
    "maptext1": "This is a map of the US in 1803.",
    "maptext2": "The green area represents the United States. The yellow shows the newly acquired Louisiana Territory. The red marks land owned by Spain, and the pink represents Spanish-controlled Florida.",
    "maptext3": "We need to plan a route for Lewis and Clark. From here in Illinois, all the way to the Pacific Ocean.",
    "maptext4": "Firstly we need to know which direction we want Lewis and Clark to explore.",
    "mapDecisionText1": "Which direction shall we expand?",
    "mapDecisionAnswer1North": "North",
    "mapDecisionAnswer2South": "South",
    "mapDecisionAnswer3East": "East",
    "mapDecisionAnswer4West": "West",
    "mapDecisionAnswerWrong": "We could expand in that direction but it wouldn't fulfil the dream of Manifest Destiny.",
    "mapDecisionAnswerCorrect": "Excellent, we should definitely expand west. Let's head to the Mississippi river on the Lousianna border.",
    "mapDecision2Text1": "At the Mississippi River, you meet a Shoshone woman named Sacagawea and an Indigenous tribe living on the land. What should we do?",
    "mapDecision2Answer1": "Take their land by force.",
    "mapDecision2Answer2": "Try to make peace and allow sacagawea to accompany you on the journey to the pacific coast. Her knowledge of the land could come in vitally useful.",
    "mapDecision2Answer3": "Turn around and go back.",
    "mapDecision2AnswerWrong": "Trying to take their land by force will cause tension and violence. Maybe there is another way we can approach this scenario.",
    "mapDecision2AnswerCorrect": "Excellent, Trying to make peace and spread Democracy fulfils one of Thomas Jeffersons priorities for Westward Expansion. With Sacagawea with us, we’ll be able to navigate the rough terrain much safer.  Let's move onto the Rocky Mountains.",
    "mapDecision3Text1": "At the Rocky Mountains, you discover the land is too rough. Should we keep going?",
    "mapDecision3Answer1": "Yes, it is our obvious fate and God's plan.",
    "mapDecision3Answer2": "No, we should stop here.",
    "mapDecision3Answer3": "No, we should turn around and go back.",
    "mapDecision3AnswerWrong1": "If we stop here we’ll never know what lies behind the Rocky Mountains.",
    "mapDecision3AnswerWrong2": "If we turn back we wont expand american westward and others might claim the land before us.",
    "mapDecision3AnswerCorrect": "Well done. It is America's obvious fate and God's plan to expand west, no matter how tough it gets. Let's cross carefully and reach the pacific coast.",
    "mapComplete": "We’ve made it to the pacific coast. Now we know the route, other settlers can follow in our foot steps and America can spread from the east coast all the way to the west.",
    "mapComplete2": "Lets travel forward in time and join the settlers on the Oregon Trail.",
    "stage2Scene1Text1": "Here we are in 1843, just in time to join the settlers heading west on the Oregon Trail.",
    "stage2Scene1Text2": "There's a letter on the ground here. Let’s read it!",
    "stage2Scene1Text3": "Let’s help the settlers get from Missouri to the Willamette Valley.",
    "stage2Scene1Text4": "Click the mouse or touchscreen to move the Oregon Trail settlers west.",
    "stage2Scene1Text5": "Oh, a wheel has fallen off our wagon. Please click it and put it back on the wagon so we can continue west.",
    "stage2Scene1Text6": "Up ahead, a scout has spotted an indigenous tribe living on the land.",
    "stage2Scene1Text7": "Should we go around or travel through their land?",
    "stage2Scene1Text7Choice1": "We should go around and avoid conflict.",
    "stage2Scene1Text7Choice2": "We should risk the journey. It won't be as safe, but it will be faster.",
    "stage2Scene1Text8": "By taking the quicker route right through their land, the journey might be shorter, but we risk the possibility of losing settlers to conflict and violence.",
    "stage2Scene1Text9": "That's a good idea. Going around avoids direct contact and keeps our settlers safe from any conflict or violence.",
    "oregonLetter1": "In the early 1800s, Oregon was a vast wilderness claimed by multiple nations—Russia, Spain, Britain, and the United States. After Spain and Russia gave up their claims, Britain and the U.S. agreed to share the territory. Despite this, many Indigenous groups like the Chinook and Nez Perce lived on and managed the land long before outside interest.",
    "oregonLetter2": "The Lewis and Clark expedition inspired dreams of reaching the Pacific, but the route was too difficult for most settlers. That changed in 1824 when Jedediah Smith found South Pass—a wide, flat route through the Rocky Mountains. This discovery made it possible for families to travel west by wagon.",
    "oregonLetter3": "Excited by reports of rich soil and beautiful forests, thousands of Americans rushed to settle Oregon. They traveled the 2,000-mile Oregon Trail from Missouri to the Willamette Valley. These journeys became symbols of hope, hardship, and the U.S. desire to expand westward.",
    "oregonLetter4": "President Polk pushed for full control of Oregon, but to avoid war with Britain, he agreed to split the land at the 49th parallel. Soon after, settlers flooded the region. As they claimed land, many Indigenous people were forced to leave or sign unfair treaties, changing the land forever.",
    "stage2Scene2Text1": "We’ve made it to the Rocky Mountains. Let’s get going, but be careful, this is dangerous terrain.",
    "stage2Scene2Text2": "Jedediah Smith has found a route that is easier for our wagons and does not require knowledge of the indigenous people to cross. Shall we take the South Pass or the mountain crossing?",
    "stage2Scene2Text2Choice1": "Listen to Jedediah Smith and take the South Pass through the Rocky Mountains for easier travel!",
    "stage2Scene2Text2Choice2": "Take the rough and uneasy path, following Lewis and Clark.",
    "stage2Scene2Text3": "Taking the path that Lewis and Clark took isnt a wise idea. The terrain is too rough for our wagons. If we go this way, we might lose wagons and settlers. Maybe there is another route we could take.",
    "stage2Scene2Text4": "Unlike the high, steep passes used by Lewis and Clark, South Pass was low and flat enough for wagons to cross the Rockies. Now, the path is open for colonizers to seek their fortunes in Oregon.",
    "stage2Scene2Text5": "Let’s head for the Willamette Valley.",
    "stage2Scene3Text1": "We have reached the Willamette Valley.",
    "stage2Scene3Text2": "This valley’s proximity to fresh water sources, which were very important to Indigenous groups such as the Cowlitz, also makes it a great place to settle. Shall we settle here?",
    "stage2Scene3Text2Choice1": "Yes, let’s settle in the Willamette Valley.",
    "stage2Scene3Text2Choice2": "No, let’s not choose to stop here in the Willamette Valley and carry on looking for somewhere else to settle.",
    "stage2Scene3Text3": "Your group continues to search for a different location, possibly facing more hardships during the journey. This outcome means we lose easy access to water and fertile land. Maybe another choice would benefit us more.",
    "stage2Scene3Text4": "Settling in the Willamette Valley means our group will benefit from the fertile land and access to fresh water. This is a great place to build a settlement and continue our expansion to the west.",
    "stage2Scene3Text5": "Thanks to you, the Oregon Trail has been a success.",
    "stage2Scene3Text6": "Let’s travel forward in time again and witness the causes and outcomes of the Annexation of Texas and the Mexican-American War. Press the time travel button when you're ready.",
    "stage3Scene1Text1": "We have just arrived in 1821. We appear to be in Stephen Austin’s study.",
    "stage3Scene1Text2": "There's a letter here, let’s read it.",
    "texasLetter1header": "Why Americans Wanted Texas",
    "texasLetter1": "Many Americans—especially in the South—wanted Texas because its land was great for growing cotton, a very valuable crop. Sadly, much of this cotton was grown using the labor of enslaved people. At the same time, many Native American tribes like the Apache, Comanche, Cherokee, and Kiikaapoi were living in Texas.",
    "texasLetter2header": "How Americans Came to Texas",
    "texasLetter2": "In 1821, a man named Moses Austin asked Spain if he could start a U.S. colony in Texas. Spain said yes, but Moses died that year. His son, Stephen F. Austin, took over the plan. That same year, Mexico became independent from Spain and took control of Texas. Mexican leaders told Stephen he could start his colony if he followed some rules",
    "texasLetter3header": "The Rules",
    "texasLetter3": "The settlers had to be good, hardworking people, become Mexican citizens, and join the Catholic Church. Stephen agreed, and by 1827, 297 families had moved to Texas. They were called the “Old Three Hundred.”",
    "stage3Scene1Text3": "These rules have been written down and hidden around this office.",
    "stage3Scene1Text4Task": "Search the office and click or press on where you think the papers might be.",
    "stage3Scene1Rule1": "Rule 1: The settlers had to be good, hardworking people.",
    "stage3Scene1Rule2": "Rule 2: The settlers had to become Mexican citizens.",
    "stage3Scene1Rule3": "Rule 3: The settlers had to join the Catholic Church.",
    "stage3Scene1Rule4": "Rule 4: Settlers weren't allowed to hunt animals.",
    "stage3Scene1Rule5": "Rule 5: Settlers must leave in a few years.",
    "stage3Scene1IsThisCorrect": "Is this one of the rules given to Stephen Austin by Mexican officials?",
    "stage3Scene1Rule1Answer": "Correct! Mexican officials wanted all settlers to be good, hardworking people.",
    "stage3Scene1Rule2Answer": "That's right! Mexican officials wanted all American settlers to become Mexican citizens.",
    "stage3Scene1Rule3Answer": "Well done. Mexican officials asked the settlers to join the Catholic Church.",
    "stage3Scene1Rule4Answer": "This doesn't sound right. Without hunting, food would be scarce. Keep looking!",
    "stage3Scene1Rule5Answer": "This sounds incorrect. The settlers were never given a time limit on their expansion into Texas.",
    "stage3Scene1TextEnd": "That's all the terms of settlement found. Let's move forward now and go meet the American settlers who moved to Texas.",
    "stage3Scene2Text1": "We made it to Texas in 1830. That's Polk up ahead in front of that building.",
    "stage3Scene2Text2": "Let's go talk to him.",
    "stage3Scene2Text3": "Greetings. I have a task for you. Before we do, please read this letter I have for you.",
    "mexicoLetter1header": "Rising Tensions in Texas t",
    "mexicoLetter1a": "By 1830, over 25,000 Americans had moved to Texas, outnumbering the 4,000 Tejanos (Texans of Mexican descent). Americans didn’t like following Mexican laws, hated having to use Spanish in official documents, and were angry when Mexico banned slavery in 1829.",
    "mexicoLetter1b": "Meanwhile, Tejanos were frustrated that many Americans settled illegally and ignored Mexican culture. Fearing U.S. takeover, the Mexican government banned further American immigration and sent troops to enforce the law.",
    "mexicoLetter2header": "Calls for Rebellion",
    "mexicoLetter2a": "Angry at Mexico’s actions, some Texans called for revolution. William Travis led one group pushing for rebellion, while Stephen F. Austin asked Mexico to allow immigration again and give Texas more control.",
    "mexicoLetter2b": "In 1833, Austin went to Mexico, but General Santa Anna had him arrested for promoting rebellion. When he was released, Texans began to revolt.",
    "mexicoLetter3header": "The Battle of the Alamo",
    "mexicoLetter3a": "In 1836, Santa Anna’s army reached San Antonio. Around 180 Texans, including famous figures like Davy Crockett and James Bowie, defended the Alamo mission. Santa Anna flew a black flag—meaning no mercy. The Texans refused to surrender.",
    "mexicoLetter3b": "After 12 days of cannon fire, Mexican troops stormed the Alamo. All defenders were killed, and any survivors were executed. Though Santa Anna called it a “small affair,” the loss enraged Texans.",
    "mexicoLetter4header": "Texas Fights Back",
    "mexicoLetter4a": "Sam Houston led the Texan army in retreat, hoping to stretch Santa Anna’s supply lines. In April, near the San Jacinto River, Houston surprised Santa Anna’s exhausted troops with an afternoon attack. The Texans won, and Santa Anna was captured. He ordered his army out of Texas in exchange for his freedom. ",
    "mexicoLetter3header": "Annexing Texas",
    "mexicoLetter5a": "Texas became an independent nation—the "Lone Star Republic"—but most Texans wanted to join the U.S. Northerners opposed annexation due to slavery, while Southerners supported it. By 1845, enslaved people in Texas had grown from 5,000 to 24,000. Some feared that adding Texas would cause war with Mexico.",
    "mexicoLetter5b": "In the 1844 election, candidate James K. Polk supported annexation as part of manifest destiny. After Polk won, Congress voted to admit Texas as the 28th U.S. state in 1845.",
    "stage3Scene2Text4": "Around town, there are US settlers who want to talk to you. They all have concerns about settling in Texas. Please gather these concerns and bring them back to me.",
    "stage3Scene2UsConcern1Laws": "The Mexican government wants us to follow their rules and laws. We are used to governing ourselves.",
    "stage3Scene2UsConcern2Docs": "We are all unhappy that all official documents have to be in Spanish.",
    "stage3Scene2UsConcern3Outlawed": "Several of us are upset that Mexico outlawed enslavement in 1829.",
    "stage3Scene2UsConcern4Hunt": "People are unhappy that the Mexicans won't let us hunt.",
    "stage3Scene2ReturnToPolk": "Let's report back to Polk.",
    "stage3Scene2Text4Select": "Please select all the correct concerns of the US settlers in Texas.",
    "stage3Scene2Text5Wrong": "One of these is wrong. Talk to settlers again or look at the book in your inventory to refresh your memory.",
    "stage3Scene2Text6Correct": "Excellent, thank you. These concerns are important for keeping settlers happy.",
    "stage3Scene2Text7": "Mexico has banned US immigration into Texas, and no more US settlers are allowed to immigrate here.",
    "stage3Scene2Text8": "It appears many US settlers are angry at Mexico’s actions, and some of the US Texans are calling for revolution. I shall send Stephen F. Austin to Mexico to ask Mexico to allow immigration again and give Texas more control.",
    "stage3Scene2Text9End": "Let’s head there now and talk to Stephen F Austin!"    
  },
  "es": {
    "newGame": "New Game!",
    "continue": "Continue?",
    "ipadButton": "iPad",
    "chromebookButton": "Chromebook",
    "labText1": "Incoming transmission… Robot 419, do you read us?",
    "labText2": "Your mission today: travel back to America in the early 1800s and learn all you can about Manifest Destiny and witness firsthand America’s westward expansion.",
    "labText3": "Start by collecting the letter and the time travel device on the table in front of you. Tap the screen or click to move closer.",
    "labText4": "This letter was sent back by our Correspondence Bot, currently stationed in the 1800s. Let’s open it and see what it says.",
    "labText5": "Greetings, Robot 419!",
    "labText6": "Manifest Destiny was the 19th-century belief that it was the United States 'Obvious Fate' to expand across all of North America. Coined by journalist John O’Sullivan in 1845, it claimed Americans had a divine duty to spread democracy and liberty.",
    "labText7": "This idea was used to ignore land claims by Great Britain, Mexico, and Indigenous peoples. Supporters believed expansion was part of God’s plan, even if it meant using force or unfair tactics.",
    "labText8": "By 1848, the U.S. had tripled in size, gaining land through treaties, settlements, deception, and war, all in the name of spreading American values.",
    "labText9": "I've placed this information in a book in your inventory. There is a button at the top right of he screen to open it. Let's do that now.",
    "labText10": "You can see there is a book in your inventory. Let's open it.",
    "labText11": "This book contains all the information we learned in the correspondence bot's letter. You can close it with the small X button in the top right of the book.",
    "labText12": "Okay. Let's head back to 1803 with our time travel device. Please push the big red button when ready.",
    "labText13": "",
    "labText14": "",
    "book1BP1": "In the 1800s, many Americans believed it was their country’s 'obvious fate' to grow across the whole continent.",
    "book1BP2": "A man named John O’Sullivan came up with the phrase 'Manifest Destiny' in 1845.",
    "book1BP3": "People thought it was their duty from God to spread freedom and democracy to new lands.",
    "book1BP4": "This belief was used to ignore the rights of Great Britain, Mexico, and Indigenous peoples who already lived on the land.",
    "book1BP5": "Some Americans believed that expansion was right, even if it meant using force or unfair methods.",
    "book1BP6": "By 1848, the United States had tripled in size through treaties, settlements, trickery, and war.",
    "book2BP1": "America is destined to expand westward and claim new land. Our young nation didn’t begin to grow through war — we grew with smart deals and brave settlers.",
    "book2BP2": "A man named James Monroe was sent to buy New Orleans for our farmers. Napoleon and France surprised us — they sold the US all of Louisiana instead! This peaceful deal doubled the country size.",
    "book2BP3": "In Texas, Americans moved in with Mexico’s permission. They promised to follow the rules — no fighting, just settlement.",
    "book2BP4": "Out west, Lewis and Clark explored new lands. Later, a path known as the South Pass made it easier for wagons to reach Oregon. As more settlers arrived, so did our claim.",
    "book3BP1": "In the early 1800s, farmers needed the Mississippi River and the port of New Orleans to sell their crops. If they lost access, they couldn’t make money.",
    "book3BP2": "The land west of the river—Louisiana—was owned by France. Farmers worried Napoleon might close New Orleans and stop their trade.",
    "book3BP3": "After losing a colony in Haiti, Napoleon changed his mind and the British were approaching. Instead of just New Orleans, he considered selling the whole Louisiana Territory. ",
    "book3BP4": "President Jefferson sent James Monroe to buy New Orleans for $10 million. But Napoleon offered the whole Louisiana Territory for $15 million!",
    "book4BP1": "Political Motivation: Many Americans believed in Manifest Destiny—the idea that the U.S. had a right to expand west and spread democracy and freedom.",
    "book4BP2": "Willing to Confront Rivals: The U.S. was prepared to challenge powerful nations like Great Britain and Mexico to fulfill its expansion goals.",
    "book4BP3": "Economic Opportunity: Western lands like Louisiana and Oregon promised valuable resources, trade routes, and fertile farmland for settlers.",
    "book4BP4": "Cultural Beliefs: Americans believed it was their God-given duty to spread their way of life, seeing themselves as culturally and morally superior.",
    "book5BP1": "Oregon was originally claimed by four nations—Russia, Spain, Britain, and the U.S.—but Indigenous groups like the Chinook and Nez Perce lived there long before those claims.",
    "book5BP2": "Spain and Russia gave up their claims, leaving Britain and the U.S. to jointly occupy the territory for a time.",
    "book5BP3": "Oregon Fever swept the nation as settlers were drawn by reports of rich farmland and forests, leading to thousands traveling the 2,000-mile Oregon Trail.",
    "book5BP4": "The Lewis and Clark expedition inspired Americans to head west, but it wasn’t until Jedediah Smith discovered South Pass in 1824 that wagons could make the journey safely.",
    "book5BP5": "President Polk demanded all of Oregon, but compromised with Britain by splitting the land at the 49th parallel to avoid war. ",
    "book5BP6": "As settlers moved in, Indigenous people were displaced by broken treaties and forced off their ancestral lands.",
    "referenceButton": "Reference",
    "citationInfoBook1": "Manifest Destiny and the Growing Nation - Introduction - Page 1",
    "stage1Text1": "Wow, we're really in 1803. There's a piece of paper on the ground here. Let's read it!",
    "stage1Text2": "We need to find Thomas Jefferson. Could you please search the camp for a wooden sign with the meaning of “Manifest Destiny” written on it?",
    "stage1Text3": "Does this sign have the meaning of the term 'Manifest Destiny' written on it?",
    "stage1Text4": "It sounds correct, but it isn’t. Have a look at the book in your inventory and try again.",
    "stage1Text5": "That's correct. Manifest Destiny means 'Obvious Fate'. Oh look, Thomas Jefferson is here and approaching us. Let's talk to him.",
    "signText1": "Obvious Fate",
    "signText2": "Certain Fate",
    "signText3": "Misplaced Fate",
    "thomasJefferson1Pretext": "My name is Thomas Jefferson. I have written you a letter. Will you please read it? Then I have a task I need you to complete for me.",
    "thomasJefferson1Letter1": "America is destined to expand westward and claim new land. Our young nation didn’t begin to grow through war — we grew with smart deals and brave settlers.",
    "thomasJefferson2Letter2": "I sent a man named James Monroe to buy New Orleans for our farmers. Napoleon and France surprised us — they sold us all of Louisiana instead! One peaceful deal doubled our country.",
    "thomasJefferson3Letter3": "In Texas, Americans moved in with Mexico’s permission. They promised to follow the rules — no fighting, just settlement.  Out west, Lewis and Clark explored new lands. Later, a path known as the South Pass made it easier for wagons to reach Oregon. As more settlers arrived, so did our claim.",
    "thomasJefferson4Letter4": "We used exploration, trade, and peaceful agreements — not armies — to begin to shape America’s future.",
    "thomasJeffersonWesternPrior1": "One of my great hopes for westward expansion is to open trade routes stretching from the Mississippi River all the way to the Pacific Ocean. Such paths would link our farms and cities to new ports and markets.",
    "thomasJeffersonWesternPrior2": "Along the way, we must greet the native nations with respect. Through fair trade and cultural exchange, I believe we can build trust and friendship as we journey west.",   
    "thomasJeffersonWesternPrior3": "I have written down these priorities for westward expansion, but I have left them around camp. Can you please search through the tents and crates to see if you can find them? There should be 3 to find.",
    "stage1Scene2MiniGame2Text": "Find 3 of Thomas Jefferson's priorities for Westward Expansion. Look through the crates in camp.",
    "stage1Scene2MiniGame2Question": "Is this one of Thomas Jefferson's priorities for Westward Expansion?",
    "stage1Scene2MiniGame2InCorrect": "Are you sure? Have a look at the books in your inventory and try again!",
    "stage1Scene2MiniGame2Correct1": "Correct, Thomas Jefferson prioritized creating trade routes along the Mississippi to reach the Pacific Ocean.",
    "stage1Scene2MiniGame2Correct2": "Correct, Thomas Jefferson saw greeting the natives and gaining good relations as a priority for westward expansion.",
    "stage1Scene2MiniGame2Correct3": "Correct, offering trade and a cultural exchange with the natives as a priority for westward expansion.",
    "stage1Scene2MiniGame2Answer1": "Offer native tribes trade and a cultural exchange.",
    "stage1Scene2MiniGame2Answer2": "Create trade routes along the Mississippi.",
    "stage1Scene2MiniGame2Answer3": "Greet native tribes and gain good relations.",
    "stage1Scene2MiniGame2Answer4": "Collect types of rocks to study back home.",
    "stage1Scene2MiniGame2Complete": "That's all 3 priorities collected. Let us head back to talk to Thomas Jefferson.",
    "stage1Scene2MoveToParis": "I have sent James Monroe to Paris to talk to Napoleon. Could you please head there now and see how the negotiations are progressing?",
    "stage1Scene3Start": "We’ve been transported to Napoleon's study in Paris. There's a letter here. Let’s read it!",    
    "napoleonLetter1": "In the early 1800s, American farmers were moving west. They used the Mississippi River to send crops to market through the port of New Orleans. It was super important — without it, they couldn’t sell their food.",
    "napoleonLetter2": "The land west of the river was called Louisiana. It belonged to France, led by Napoleon. He wanted to use the land to help feed his Caribbean colonies. But farmers were worried — if Napoleon closed New Orleans, they were stuck.",
    "napoleonLetter3": "Then, something big happened. In Haiti, formerly enslaved people led by Toussaint L’Ouverture defeated the French. Napoleon no longer needed Louisiana, and with a war against Britain coming, he decided to sell the land instead of risking losing it.",
    "napoleonLetter4": "President Jefferson sent James Monroe to buy New Orleans for $10 million. But Napoleon offered the whole Louisiana Territory for $15 million! That’s double the land for a great price.",
    "napoleonLetter5": "Some Americans didn’t like it — they thought it was too much land or that it broke the rules of the Constitution. But most people were excited. In 1804, Lewis and Clark set off to explore the new land, with help from a Shoshone woman named Sacagawea.",
    "stage1Scene3Talks": "Napoleon and Monroe are starting negotiations. Let's take part in the talks and see if we can help them come to an agreement.",
    "taskStage1Scene3": "Take control of Napoleon and Monroe and choose what each one should say in the discussion of the Louisiana Purchase.",
    "napoleonName": "Napoleon",
    "jamesMonroeName": "James Monroe",
    "choiceA": "Choice A",
    "choiceB": "Choice B",
    "napoleonChoice1a": "War with Britain is coming, we must act swiftly, before the British seize our lands.",
    "napoleonChoice1b": "I think keeping hold of Lousianna is the best idea, in case we win the war with Britain.",
    "monroeChoice1a": "We are prepared to purchase New Orleans.",
    "monroeChoice1b": "What are your intentions with Louisiana?",
    "napoleonChoice2a": "I will sell all of Louisiana for $15 million.",
    "napoleonChoice2b": "I can part with New Orleans for $10 million.",
    "monroeChoice2a": "Accept the full Louisiana deal.",
    "monroeChoice2b": "Insist on New Orleans only.",
    "monroeChoiceBuyLouisiana": "Success! For just $15 million, Monroe buys the entire Louisiana Territory, doubling the size of the U.S. and securing control of the Mississippi River!",
    "monroeChoiceBuyOrleans": "Monroe gets the port of New Orleans, but the vast Louisiana Territory stays in French hands. The U.S. misses a huge chance to expand west. Try again.",
    "textToMoveToScene1Stage4": "Let's head back to the US and tell Thomas Jefferson the great news!",
    "startScene1Stage4": "Let's talk to Thomas Jefferson.",
    "stage1Scene4Text1": "Welcome Back. I’ve just been told the great news about Louisiana.",
    "stage1Scene4Text2": "Now we should start looking at exploring it.",   
    "stage1Scene4Text3": "But before we do, this letter arrived for you. Take a look!",   
    "stage1Scene4Text4": "Meet Lewis and Clark. These brave explorers are going to map out and chart a route from Illinois all the way west to the pacific ocean.",   
    "stage1Scene4Text5": "But we need your help. On the table there is a map of the US.",   
    "stage1Scene4Text6": "We need you to look at it and help us make decisions on what Lewis and Clark should do along the way.",   
    "stage1Scene4Text7": "When you're ready. Approach the map.",
    "politicalEcoCultureLetter1": "Politically, the U.S. believed it was its Manifest Destiny to expand westward. Many Americans thought they had a right to spread U.S. political ideals—like democracy and freedom—to new lands. They were also willing to challenge other nations, such as Great Britain and Mexico, to achieve this goal.",
    "politicalEcoCultureLetter2": "Economically, gaining control of areas like Louisiana, the Oregon Territory, and western lands offered valuable resources, new trade routes, and fertile farmland. These were key economic reasons that motivated many settlers to move west.", 
    "politicalEcoCultureLetter3": "Culturally, a major reason for expansion was the belief in American superiority and divine right. Many people felt it was “God’s plan” for Americans to spread west, and they believed it was their moral duty to bring their way of life to new territories.",
    "mapKeyAmerica": "America",
    "mapKeyLouisiana": "Louisiana",
    "mapKeySpanish": "Spanish Territory",
    "mapKeyFlorida": "Florida",
    "mapStartIllinois": "Illinois",
    "mapPoint1Mississippi": "Mississippi river",
    "mapPoint2RockyMountain": "Rocky Mountains",
    "mapPoint3PacificCoast": "Pacific Oceon",
    "maptext1": "This is a map of the US in 1803.",
    "maptext2": "The green area represents the United States. The yellow shows the newly acquired Louisiana Territory. The red marks land owned by Spain, and the pink represents Spanish-controlled Florida.",
    "maptext3": "We need to plan a route for Lewis and Clark. From here in Illinois, all the way to the Pacific Ocean.",
    "maptext4": "Firstly we need to know which direction we want Lewis and Clark to explore.",
    "mapDecisionText1": "Which direction shall we expand?",
    "mapDecisionAnswer1North": "North",
    "mapDecisionAnswer2South": "South",
    "mapDecisionAnswer3East": "East",
    "mapDecisionAnswer4West": "West",
    "mapDecisionAnswerWrong": "We could expand in that direction but it wouldn't fulfil the dream of Manifest Destiny.",
    "mapDecisionAnswerCorrect": "Excellent, we should definitely expand west. Let's head to the Mississippi river on the Lousianna border.",
    "mapDecision2Text1": "At the Mississippi River, you meet a Shoshone woman named Sacagawea and an Indigenous tribe living on the land. What should we do?",
    "mapDecision2Answer1": "Take their land by force.",
    "mapDecision2Answer2": "Try to make peace and allow sacagawea to accompany you on the journey to the pacific coast. Her knowledge of the land could come in vitally useful.",
    "mapDecision2Answer3": "Turn around and go back.",
    "mapDecision2AnswerWrong": "Trying to take their land by force will cause tension and violence. Maybe there is another way we can approach this scenario.",
    "mapDecision2AnswerCorrect": "Excellent, Trying to make peace and spread Democracy fulfils one of Thomas Jeffersons priorities for Westward Expansion. With Sacagawea with us, we’ll be able to navigate the rough terrain much safer.  Let's move onto the Rocky Mountains.",
    "mapDecision3Text1": "At the Rocky Mountains, you discover the land is too rough. Should we keep going?",
    "mapDecision3Answer1": "Yes, it is our obvious fate and God's plan.",
    "mapDecision3Answer2": "No, we should stop here.",
    "mapDecision3Answer3": "No, we should turn around and go back.",
    "mapDecision3AnswerWrong1": "If we stop here we’ll never know what lies behind the Rocky Mountains.",
    "mapDecision3AnswerWrong2": "If we turn back we wont expand american westward and others might claim the land before us.",
    "mapDecision3AnswerCorrect": "Well done. It is America's obvious fate and God's plan to expand west, no matter how tough it gets. Let's cross carefully and reach the pacific coast.",
    "mapComplete": "We’ve made it to the pacific coast. Now we know the route, other settlers can follow in our foot steps and America can spread from the east coast all the way to the west.",
    "mapComplete2": "Lets travel forward in time and join the settlers on the Oregon Trail.",
    "stage2Scene1Text1": "Here we are in 1843, just in time to join the settlers heading west on the Oregon Trail.",
    "stage2Scene1Text2": "There's a letter on the ground here. Let’s read it!",
    "stage2Scene1Text3": "Let’s help the settlers get from Missouri to the Willamette Valley.",
    "stage2Scene1Text4": "Click the mouse or touchscreen to move the Oregon Trail settlers west.",
    "stage2Scene1Text5": "Oh, a wheel has fallen off our wagon. Please click it and put it back on the wagon so we can continue west.",
    "stage2Scene1Text6": "Up ahead, a scout has spotted an indigenous tribe living on the land.",
    "stage2Scene1Text7": "Should we go around or travel through their land?",
    "stage2Scene1Text7Choice1": "We should go around and avoid conflict.",
    "stage2Scene1Text7Choice2": "We should risk the journey. It won't be as safe, but it will be faster.",
    "stage2Scene1Text8": "By taking the quicker route right through their land, the journey might be shorter, but we risk the possibility of losing settlers to conflict and violence.",
    "stage2Scene1Text9": "That's a good idea. Going around avoids direct contact and keeps our settlers safe from any conflict or violence.",
    "oregonLetter1": "In the early 1800s, Oregon was a vast wilderness claimed by multiple nations—Russia, Spain, Britain, and the United States. After Spain and Russia gave up their claims, Britain and the U.S. agreed to share the territory. Despite this, many Indigenous groups like the Chinook and Nez Perce lived on and managed the land long before outside interest.",
    "oregonLetter2": "The Lewis and Clark expedition inspired dreams of reaching the Pacific, but the route was too difficult for most settlers. That changed in 1824 when Jedediah Smith found South Pass—a wide, flat route through the Rocky Mountains. This discovery made it possible for families to travel west by wagon.",
    "oregonLetter3": "Excited by reports of rich soil and beautiful forests, thousands of Americans rushed to settle Oregon. They traveled the 2,000-mile Oregon Trail from Missouri to the Willamette Valley. These journeys became symbols of hope, hardship, and the U.S. desire to expand westward.",
    "oregonLetter4": "President Polk pushed for full control of Oregon, but to avoid war with Britain, he agreed to split the land at the 49th parallel. Soon after, settlers flooded the region. As they claimed land, many Indigenous people were forced to leave or sign unfair treaties, changing the land forever.",
    "stage2Scene2Text1": "We’ve made it to the Rocky Mountains. Let’s get going, but be careful, this is dangerous terrain.",
    "stage2Scene2Text2": "Jedediah Smith has found a route that is easier for our wagons and does not require knowledge of the indigenous people to cross. Shall we take the South Pass or the mountain crossing?",
    "stage2Scene2Text2Choice1": "Listen to Jedediah Smith and take the South Pass through the Rocky Mountains for easier travel!",
    "stage2Scene2Text2Choice2": "Take the rough and uneasy path, following Lewis and Clark.",
    "stage2Scene2Text3": "Taking the path that Lewis and Clark took isnt a wise idea. The terrain is too rough for our wagons. If we go this way, we might lose wagons and settlers. Maybe there is another route we could take.",
    "stage2Scene2Text4": "Unlike the high, steep passes used by Lewis and Clark, South Pass was low and flat enough for wagons to cross the Rockies. Now, the path is open for colonizers to seek their fortunes in Oregon.",
    "stage2Scene2Text5": "Let’s head for the Willamette Valley.",
    "stage2Scene3Text1": "We have reached the Willamette Valley.",
    "stage2Scene3Text2": "This valley’s proximity to fresh water sources, which were very important to Indigenous groups such as the Cowlitz, also makes it a great place to settle. Shall we settle here?",
    "stage2Scene3Text2Choice1": "Yes, let’s settle in the Willamette Valley.",
    "stage2Scene3Text2Choice2": "No, let’s not choose to stop here in the Willamette Valley and carry on looking for somewhere else to settle.",
    "stage2Scene3Text3": "Your group continues to search for a different location, possibly facing more hardships during the journey. This outcome means we lose easy access to water and fertile land. Maybe another choice would benefit us more. ",
    "stage2Scene3Text4": "Settling in the Willamette Valley means our group will benefit from the fertile land and access to fresh water. This is a great place to build a settlement and continue our expansion to the west.",
    "stage2Scene3Text5": "Thanks to you, the Oregon Trail has been a success.",
    "stage2Scene3Text6": "Let’s travel forward in time again and witness the causes and outcomes of the Annexation of Texas and the Mexican-American War. Press the time travel button when you're ready.",
    "stage3Scene1Text1": "We have just arrived in 1821. We appear to be in Stephen Austin’s study.",
    "stage3Scene1Text2": "There's a letter here, let’s read it.",
    "texasLetter1header": "Why Americans Wanted Texas",
    "texasLetter1": "Many Americans—especially in the South—wanted Texas because its land was great for growing cotton, a very valuable crop. Sadly, much of this cotton was grown using the labor of enslaved people. At the same time, many Native American tribes like the Apache, Comanche, Cherokee, and Kiikaapoi were living in Texas.",
    "texasLetter2header": "How Americans Came to Texas",
    "texasLetter2": "In 1821, a man named Moses Austin asked Spain if he could start a U.S. colony in Texas. Spain said yes, but Moses died that year. His son, Stephen F. Austin, took over the plan. That same year, Mexico became independent from Spain and took control of Texas. Mexican leaders told Stephen he could start his colony if he followed some rules",
    "texasLetter3header": "The Rules",
    "texasLetter3": "The settlers had to be good, hardworking people, become Mexican citizens, and join the Catholic Church. Stephen agreed, and by 1827, 297 families had moved to Texas. They were called the “Old Three Hundred.”",
    "stage3Scene1Text3": "These rules have been written down and hidden around this office.",
    "stage3Scene1Text4Task": "Search the office and click or press on where you think the papers might be.",
    "stage3Scene1Rule1": "Rule 1: The settlers had to be good, hardworking people.",
    "stage3Scene1Rule2": "Rule 2: The settlers had to become Mexican citizens.",
    "stage3Scene1Rule3": "Rule 3: The settlers had to join the Catholic Church.",
    "stage3Scene1Rule4": "Rule 4: Settlers weren't allowed to hunt animals.",
    "stage3Scene1Rule5": "Rule 5: Settlers must leave in a few years.",
    "stage3Scene1IsThisCorrect": "Is this one of the rules given to Stephen Austin by Mexican officials?",
    "stage3Scene1Rule1Answer": "Correct! Mexican officials wanted all settlers to be good, hardworking people.",
    "stage3Scene1Rule2Answer": "That's right! Mexican officials wanted all American settlers to become Mexican citizens.",
    "stage3Scene1Rule3Answer": "Well done. Mexican officials asked the settlers to join the Catholic Church.",
    "stage3Scene1Rule4Answer": "This doesn't sound right. Without hunting, food would be scarce. Keep looking!",
    "stage3Scene1Rule5Answer": "This sounds incorrect. The settlers were never given a time limit on their expansion into Texas.",
    "stage3Scene1TextEnd": "That's all the terms of settlement found. Let's move forward now and go meet the American settlers who moved to Texas.",
    "stage3Scene2Text1": "We made it to Texas in 1830. That's Polk up ahead in front of that building.",
    "stage3Scene2Text2": "Let's go talk to him.",
    "stage3Scene2Text3": "Greetings. I have a task for you. Before we do, please read this letter I have for you.",
    "mexicoLetter1header": "Rising Tensions in Texas t",
    "mexicoLetter1a": "By 1830, over 25,000 Americans had moved to Texas, outnumbering the 4,000 Tejanos (Texans of Mexican descent). Americans didn’t like following Mexican laws, hated having to use Spanish in official documents, and were angry when Mexico banned slavery in 1829.",
    "mexicoLetter1b": "Meanwhile, Tejanos were frustrated that many Americans settled illegally and ignored Mexican culture. Fearing U.S. takeover, the Mexican government banned further American immigration and sent troops to enforce the law.",
    "mexicoLetter2header": "Calls for Rebellion",
    "mexicoLetter2a": "Angry at Mexico’s actions, some Texans called for revolution. William Travis led one group pushing for rebellion, while Stephen F. Austin asked Mexico to allow immigration again and give Texas more control.",
    "mexicoLetter2b": "In 1833, Austin went to Mexico, but General Santa Anna had him arrested for promoting rebellion. When he was released, Texans began to revolt.",
    "mexicoLetter3header": "The Battle of the Alamo",
    "mexicoLetter3a": "In 1836, Santa Anna’s army reached San Antonio. Around 180 Texans, including famous figures like Davy Crockett and James Bowie, defended the Alamo mission. Santa Anna flew a black flag—meaning no mercy. The Texans refused to surrender.",
    "mexicoLetter3b": "After 12 days of cannon fire, Mexican troops stormed the Alamo. All defenders were killed, and any survivors were executed. Though Santa Anna called it a “small affair,” the loss enraged Texans.",
    "mexicoLetter4header": "Texas Fights Back",
    "mexicoLetter4a": "Sam Houston led the Texan army in retreat, hoping to stretch Santa Anna’s supply lines. In April, near the San Jacinto River, Houston surprised Santa Anna’s exhausted troops with an afternoon attack. The Texans won, and Santa Anna was captured. He ordered his army out of Texas in exchange for his freedom. ",
    "mexicoLetter3header": "Annexing Texas",
    "mexicoLetter5a": "Texas became an independent nation—the "Lone Star Republic"—but most Texans wanted to join the U.S. Northerners opposed annexation due to slavery, while Southerners supported it. By 1845, enslaved people in Texas had grown from 5,000 to 24,000. Some feared that adding Texas would cause war with Mexico.",
    "mexicoLetter5b": "In the 1844 election, candidate James K. Polk supported annexation as part of manifest destiny. After Polk won, Congress voted to admit Texas as the 28th U.S. state in 1845.",
    "stage3Scene2Text4": "Around town, there are US settlers who want to talk to you. They all have concerns about settling in Texas. Please gather these concerns and bring them back to me.",
    "stage3Scene2UsConcern1Laws": "The Mexican government wants us to follow their rules and laws. We are used to governing ourselves.",
    "stage3Scene2UsConcern2Docs": "We are all unhappy that all official documents have to be in Spanish.",
    "stage3Scene2UsConcern3Outlawed": "Several of us are upset that Mexico outlawed enslavement in 1829.",
    "stage3Scene2UsConcern4Hunt": "People are unhappy that the Mexicans won't let us hunt.",
    "stage3Scene2ReturnToPolk": "Let's report back to Polk.",
    "stage3Scene2Text4Select": "Please select all the correct concerns of the US settlers in Texas.",
    "stage3Scene2Text5Wrong": "One of these is wrong. Talk to settlers again or look at the book in your inventory to refresh your memory.",
    "stage3Scene2Text6Correct": "Excellent, thank you. These concerns are important for keeping settlers happy.",
    "stage3Scene2Text7": "Mexico has banned US immigration into Texas, and no more US settlers are allowed to immigrate here.",
    "stage3Scene2Text8": "It appears many US settlers are angry at Mexico’s actions, and some of the US Texans are calling for revolution. I shall send Stephen F. Austin to Mexico to ask Mexico to allow immigration again and give Texas more control.",
    "stage3Scene2Text9End": "Let’s head there now and talk to Stephen F Austin!"                      
  }
}
